{
    "title": "We Are ...",
    "introduction": "a funny performance duo. More professionally speaking, we are a performance duo that is willing to laugh at ourselves, to take bold risks, and to speak truths that are tucked away in our bodies and in the world.",
    "secondaryTitle": "But… more seriously speaking",
    "secondaryIntro": [
        "Having inherited the legacy of modernity, we are no longer fearful of rebellion. Yet the noises of contemporaneity urge us to further craft, stipulate, imagine, reflect, and practice what it means to be truly avant-garde in dance that remains relevant today.",
        "The answers we offer through our choreography lie not only in the content of our creations — we explore a wide range of themes: myth, folklore, intimacy and violence — but also in the form that we strive to innovate, by incorporating pioneering bodily techniques of Gaga, Countertechnique, contact improv, and release techniques, as well as dramaturgical technologies. "
    ],
    "profiles": [
        {
            "name": "Xiao Liang",
            "intro": "Xiao Liang (Maggie) was born and raised in Sichuan, China. She graduated summa cum laude from New York University Shanghai with a degree in Philosophy, but it is her minor in dance that has fueled her lifelong dedication to art through movement and choreography. Since then, she has been actively learning, teaching, dancing, and choreographing across the United States. Her choreography (in which she often performs herself) has been presented at American Dance Festival, Bates Dance Festival, ACDA Baja Regional Conference, Stomping Grounds LA, MashUp Dance LA, Columbus Dance Theater, and Powerlong Museum Shanghai. Her recent work received the merit honoree of New Century Dance Project of 2024. She has trained in frontier contemporary dance techniques including Gaga, release, contact improv and Countertechnique. She is also connected with the contact improv communities in LA, NYC, Shanghai and her hometown Chengdu. Recently, she has completed her Master of Fine Arts in Dance at the University of California, Irvine. She is currently dancing with WhirlWind Dance Company and Xclaim Dance Company in Columbus, Ohio. "
        },
        {
            "name": "Yinqi Wang",
            "intro": "Yinqi Wang is a dancer and choreographer born and raised in China. He graduated magna cum laude in Philosophy from New York University Shanghai, with a minor in Dance, where he was first exposed to contemporary dance. He was then trained by Aly Rose, a dancer for renowned Chinese American choreographer Shen Wei. Yinqi earned his MFA in Dance at the University of California, Irvine in 2024, studying and collaborating with many renowned choreographers including Lar Lubovitch, S. Ama Wray, Lindsay Gilmoure, Charlotte Griffin, and Cyrian Reed. During his stay in America, he attended Gaga intensives and the American Dance Festival studying and working with artists including David Dorfman, Billy Barry, Shamel Pitts, etc. He is connected to the contact improvisation communities in Shanghai, L.A., and Columbus. His choreography has been selected to present at Powerlong Museum in Shanghai, Pacific Symphony, Nachmo L.A., Mashup Dance L.A., Columbus Dance Theater, and New Century Dance Project. He’s currently dancing with WhirlWind Dance Company and Columbus Modern Dance Company in Columbus Ohio. "
        }
    ]
}