{
    "slogan": "driven by a naive passion to move, a keen desire to express, and a strong dedication for physical research…",
    "projects": [
        {
            "name": "Sleepwalker, Daydreamer",
            "description": "This duet Sleepwalker, Daydreamer originates from Russian Avant Garde musician Sergey Kuryokhin’s subtle arrangement of the same melody in 3 different renditions. The layers therein seem to portray an intricate quality where one falls into the edges between dream and reality, a place where tenderness, passion, and confusion all exist. Countless moments of encounter and departure are created through the calculated usage of repetition and deconstruction. The body’s thwarted yearning could only crystalize dreams in daily gestures, and distill the passion of fantasies into the mundane. How torn! —— We are rained on under a clear sky, yell with lost voice, and sleepwalk in daytime. ",
            "footnotes": [
                "Choreographers and Performers: Yinqi Wang and Xiao Liang (Maggie)",
                "Music: “Sleepwalker I” and “Sleepwalker II” by Sergey Kuryokhin",
                "Photographer: Haley Lowenthal",
                "Special thanks to Bates Dance Festival, 2024"
            ],
            "locations": [
                "Bates Dance Festival, Lewiston, Maine (Aug 2024)",
                "Columbus Dance Theater, Columbus, Ohio (forthcoming, Sep 2024)"
            ],
            "award": [
                "Guangdong Modern Dance Festival, Guangzhou, China (forthcoming, November 2024)"
            ],
            "imagePath": "sleepwalker-daydreamer",
            "imageCount": 6
        },
        {
            "name": "Phony Pony Ho!",
            "description": "The duet Phony Pony Ho! begins with comedy and ends with comedy — yet along the way the audience is lured into a mysterious, absurd world that they don’t know if they should be stricken with fear or laughter. The cogent contrast in the narrative, emotionality and physicality in the work is the choreographers’ creative exploration and careful construction of the many unresolvable contradictions of the world:  an uncontainable greed for joy leads us to tragedy; an ambition to love forever, an urge to die young. ",
            "footnotes": [
                "Choreographers and Performers: Yinqi Wang and Xiao Liang (Maggie)",
                "Music: “Por una Cabeza” by Carlos Gardel,“Udutha Udutha Huth” by Ghantasala,“Fujiken (Final Section)” by Carl Stone,“美术鸡” by Zuoxiao Zuzhou",
                "Lighting Designer: Rin Mizumoto",
                "Photographer: Fernando Eizaguirre",
                "Special thanks to Emily Chapman, danny waters, Ari Pulido, Julian Xiong, and Timothy Frangos"
            ],
            "locations": [
                "Bates Dance Festival, Lewiston, Maine (Aug, 2024)",
                "Claire Trevor Theater at University of California, Irvine (May, 2024)",
                "Stomping Grounds, Nachmo LA (Feb, 2024)",
                "MashUp Contemporary Dance Company, LA (Feb 2024)"
            ],
            "award": [
                "Merit Honoree of New Century Dance Project, 2024"
            ],
            "imagePath": "phony-pony-ho",
            "imageCount": 6
        },
        {
            "name": "Mumulalala",
            "description": "Laugh at friends laugh at enemies/ \nLaugh at prestige laugh at kitsch/ \nLaugh at the pretentious generocity laugh at the masked selfishness/ \nLaugh at vaping laugh at weed/ \nLaugh at artists/ \nLaugh at the casual indifference laugh at the excessive sentimentality/ \nLaugh at cancel culture laugh at free speech/ \nLaugh at beggars laugh at thieves/ \nLaugh at prostitution laugh at academy/ \nLaugh at all that is laughable/for the sake of laughing/\nLaugh at life",
            "footnotes": [
                "Choreographer: Yinqi Wang",
                "Performers: Andrea Aguirre, Eliot Maroney-Sutton, Katie Waldvogel, Mia Gabbey, Olivia Johnson, Sydney Shigemoto, Yuki Miyata, Brayden Page, Yinqi Wang",
                "Music: “Rhapsody in Blue” composed by Gerorge Gershwin, performed by Philharmonia Orchestra",
                "Lighting Designer: Jimmy Balistreri",
                "Costume Designer: Kaylynn Sutton",
                "Photographer: Sam Zauscher"
            ],
            "locations": [
                "Claire Trevor Theater at University of California, Irvine (April, 2024)"
            ],
            "imagePath": "mumulalala",
            "imageCount": 6
        },
        {
            "name": "Lanimaria",
            "description": "\"In an abstract love for humanity one almost always loves oneself.\" This quote by Fyodor Dostoevsky satirically reveals the inevitable dilemma between one's heart of empathy and their selfishness. As social beings, we are, more or less, educated to fantasize a grand narrative of humanity, under which our animalistic conflicts, desires, guilt, and impulse are concealed. It is in movement's power that we return to what we once were. This work, Lanimaria, challenges the audience to tease out our shared aggression, intimacy and vulnerability from the self-hallucinating narrative of peace and love.",
            "footnotes": [
                "Choreographer: Yinqi Wang",
                "Performers: Andrea Aguirre, Chelsea Brown, Emma Brumm, Morgan Goodirich, Melanie Groba, Lisa Hao, Shayli Jomsky, Isabella Lara, Aarilyn Lee, Celia Levin, Katelyn Potyondy, Fiona Smith, Emily Spieker, Kassandra Vogel.",
                "Music: “Singanushiga” by Ye'erjiang Mahefushi & Asiha'Er Maimaiti/Traditional, “Singanushiga” by Yizaiti Yiliyasi, “Tetris-New Hardstyle Remix” by Dejv Oujé, “Korobeiniki” by Lars Mikkelsen",
                "Lighting Designer: Kassia Curls",
                "Costume Designer: Kaylynn Sutton",
                "Photographer: Skye Schmidt Varga"
            ],
            "locations": [
                "Claire Trevor Theater at University of California, Irvine (Dec, 2023)"
            ],
            "imagePath": "lanimaria",
            "imageCount": 6
        },
        {
            "name": "Orbit",
            "description": "Orbit is a trio focused on the physical research of …",
            "footnotes": [
                "Choreographer: Yinqi Wang",
                "Performers: Veronica Allen, Lily von Blanck, Yinqi Wang",
                "Music: Godot by Hilary Hahn, Hauschka",
                "Lighting Design: Jacqueline Malenke",
                "Costume Design: Kaylynn Sutton",
                "Photographer: Sam Zauscher"
            ],
            "locations": [
                "Claire Trevor Theater at University of California, Irvine (Dec, 2022)"
            ],
            "imagePath": "orbit",
            "imageCount": 6
        },
        {
            "name": "Love Me If You Dare",
            "description": "Love Me If You Dare is a dance theater piece that dives into the intimidating nature of being loved and the brave act of loving others by creating surreal worlds on stage. Going through periods of terrifying loneliness, to flirtatious romance, to a grandiose elation, to finally “pure love”, a theatrical rendition of love is expressed through movements, props, costume, and elaborate lighting design. It is inspired by Dostoevsky’s succinct postulation, “love in action is a harsh and dreadful thing compared with love in dreams. Love in dreams is greedy for immediate action, rapidly performed and in the sight of all… But active love is labor and fortitude, and for some people too, perhaps, a complete science.” ",
            "footnotes": [
                "Choreographers: Xiao Liang (Maggie) and dancers",
                "Performers: Olive Dooley, Zalen King, Xiao Liang, Fiona Liu, Laine Matkin, Vivianna McCormick, Yinqi Wang, danniel waters ",
                "Music: “洞1” by Xiao He, “橋迎舟 乘鸞女 葡萄如綠” by Ezekiah and 食草人josiah, “Ich bin der Welt abhanden gekommen” by Gustav Mahler, “主与我同在，欢乐无尽” by Laomudeng Church Choir of Yunnan Province (云南省怒江州老姆登村教堂唱诗班)",
                "Lighting Designer: Rin Mizumoto",
                "Photographer: Fernando Eizaguirre",
                "Special thanks to Emily Chapman, danny waters, Ari Pulido, Julian Xiong, and Timothy Frangos"
            ],
            "locations": [
                "Claire Trevor Theater at University of California, Irvine (May, 2024)"
            ],
            "imagePath": "love-me-if-you-dare",
            "imageCount": 6
        },
        {
            "name": "Once I Had a Dream",
            "description": "Once I Had a Dream is a dance theater work that presents a dreamscape where an innocent childhood is interrupted with the troublesome hiccups of adulthood — confusion, boredom, and self-destruction. The alienating and visceral tension between the playful childish spirit and a heavy, thwarted soul eventually ends in a hopeful utopia of children, together singing and dancing. ",
            "footnotes": [
                "Choreographers: Xiao Liang (Maggie)",
                "Performers: Gianna, Acciaaca, Veronica Allen, Caitlyn Cargononi, Allie Kalbhen, Violeta Lemoh, Theodora Oldfield, Lindsay Scarpitti, Taylor Shinnick, Kendal Villa, Allison Yolland (and Sophie Bately, Hermione Poudret, Gabija Verbalaite for re-stage)",
                "Music: “Y aura toujours” by Caravelli Et Son Orchestre, “Piano Quintet in G minor, Op. 57: II. Fugue (Adagio)” by Dmitri Shostakovich, “Nesta Terra Portuguesa” by Dona Rosa",
                "Lighting Designer: Kassia Curls",
                "Photographer: Sam Zauscher"
            ],
            "locations": [
                "American College Dance Association Baja Regional Conference, Carson, California (Jan, 2024)",
                "Claire Trevor Theater at University of California, Irvine (Dec, 2022)"
            ],
            "imagePath": "once-i-had-a-dream",
            "imageCount": 6
        },
        {
            "name": "Who Stole the Sky",
            "description": "Who stole the sky? Perhaps it is politicians, capitalism and patriarchy that stole the sky of birds, women, and innocent, intuitive creatures on earth. We dance alienation against the background of Churchill's speech, and later embody the carefreeness and hints of pain in the vocalist. A quirky, playful and helplessly jovial dance concludes the question of \"Who stole the sky.\" This is not a political piece, but it seems like demanding love and peace from politics has been an arduous and repeated task of all times.",
            "footnotes": [
                "Choreographers: Xiao Liang (Maggie) and dancers",
                "Performers:Ashton Craven, Shani Kirson, Maggie Liang, Ari Pulido, Gabija Vabalaite, Fernando Eizaguirre (understudy)",
                "Music: Excerpt from Winston Churchill’s 1940 speech “Blood, toil, tears and sweat,” “Night Birds” by Sainkho Namtchylak, “Who Stole the Sky” by Sainkho Namtchylak",
                "Lighting Designer: Mac McDermott",
                "Photographer: Skye Schmidt Varga"
            ],
            "locations": [
                "Claire Trevor Theater at University of California, Irvine (Dec, 2023)"
            ],
            "imagePath": "who-stole-the-sky",
            "imageCount": 5
        },
        {
            "name": "Mars(c)h",
            "description": "Mars(c)h is a duet choreographed and performed by two people who had never crossed path with each other. Drawn by a mutual love for dance and a surprising mutual reverence for the famous Chinese choreographer Wang Mei, the two used Wang’s signature choreographic techniques to compose their own piece. With daily gestures, subtle yet carefully-crafted partnering, as well as bursts of mad energy and life force, they intend to portray the duality of contemporary life —— we can’t help but masking ourselves, yet only in moments of revelation do we crave for “reality”; we want to be “the best of ourselves”, but are so prone to self-destruction that our ego is as if stuck in a marsh. True — in the victorious march and grimy marsh that is life, we struggle for that loud scream…",
            "footnotes": [
                "Choreographers and Performers: Xiao Liang (Maggie) and Meng Yao",
                "Music: “מארש” by The Tractor’s Revenge",
                "Lighting Designer: Junlong Li",
                "Photographer: Xucheng",
                "Special thanks to Chinese Dancers’ Association’s “Youth Artist Platform” (中国舞蹈家协会培青创造营）for this opportunity."
            ],
            "locations": [
                "Shenzhen Longgang Cultural Center Black Box, Shenzhen, China (Nov, 2023)"
            ],
            "imagePath": "marsch",
            "imageCount": 2
        },
        {
            "name": "Quantum",
            "description": "Inherent to Quantum is a captivating stillness created by the bodies’ slow and controlled move. Exploring the sweeps and exhalations of a microcosmic breath, we are submerged into a dark and vast realm, where pulsating energy is unleashed. The other-worldliness and eeriness is of great thematic interest to us. ",
            "footnotes": [
                "Choreographers and Performers: Xiao Liang, Jingxuan Xie, Yinqi Wang",
                "Artistic Director: Aly Rose",
                "Music: “Godot” by Hilary Hahn and Hauschka, “Clockmaker” by Trent Reznor and Atticus Ross",
                "Special thanks to Powerlong Museum (宝龙美术馆), Shanghai"
            ],
            "locations": [
                "Powerlong Museum, Shanghai, China (Dec, 2021)",
                "New York University Shanghai, Shanghai, China (Dec, 2021)"
            ],
            "imagePath": "quantum",
            "imageCount": 4
        },
        {
            "name": "Lines and Spirals",
            "description": "Returning to the fundamentals of form, Lines and Spirals uses the body as a dynamic paintbrush to draw lines and spirals in time and space. Created within the span of three weeks, we started from basic phrase-making and thematized it to be just about the abstract, fluid, and clean movements, which at certain points produce a swelling effect on the eyes.",
            "footnotes": [
                "Choreographers and Performers: Xiao Liang, Jingxuan Xie, Yinqi Wang",
                "Artistic Director: Aly Rose",
                "Music: “Seven Days Walking/Day One: Golden Butterflies” by Ludovico Einaudi, Federico Mecozzi, and Redi Hasa",
                "Special thanks to Powerlong Museum (宝龙美术馆), Shanghai"
            ],
            "locations": [
                "Powerlong Museum, Shanghai, China (Dec, 2021)",
                "New York University Shanghai, Shanghai, China (Dec, 2021)"
            ],
            "imagePath": "lines-and-spirals",
            "imageCount": 5
        }
    ]
}